### Terraform plan for prod
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.azurerm_client_config.current: Reading...
azurerm_resource_group.instance: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNWMyYTYyNy05NTRiLTQ2MmEtYWI1NC04ZDM3N2RkZDNlMDM7b2JqZWN0SWQ9MWZjNWI5ZTgtZDljMy00MTc5LThiNmItNDkxZjE4MDFlMDFhO3N1YnNjcmlwdGlvbklkPWM1N2MyYTAyLTI5N2QtNGY2OC05NzliLTE5NjBkZjcyMjYyNzt0ZW5hbnRJZD1lNjdjMTU4OS00NzQ3LTRiNzMtYjdiYi1kYTFiNTY3ZWUxZjU=]
azurerm_container_app_environment.apps: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.App/managedEnvironments/onlinestore-containerapps]
azurerm_container_app.website: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.App/containerApps/onlinestore-website]
azurerm_container_app.api: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.App/containerApps/onlinestore-api]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azapi_update_resource.container_app_api will be created
  + resource "azapi_update_resource" "container_app_api" {
      + body                    = jsonencode(
            {
              + properties = {
                  + configuration = {
                      + ingress = {
                          + additionalPortMappings = [
                              + 18889,
                            ]
                        }
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = (known after apply)
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.App/containerApps@2023-11-02-preview"
    }

  # azurerm_container_app.monitoring will be created
  + resource "azurerm_container_app" "monitoring" {
      + container_app_environment_id  = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.App/managedEnvironments/onlinestore-containerapps"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "onlinestore-website"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "onlinestore-prod-rg"
      + revision_mode                 = "Single"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 18888
          + transport                  = "http"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "acr-password"
          + server               = "onlinestorecontainerregistry.azurecr.io"
          + username             = (sensitive value)
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 1
          + min_replicas    = (known after apply)
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "onlinestorecontainerregistry.azurecr.io/dotnet/aspire-dashboard:8.0.0"
              + memory            = "0.5Gi"
              + name              = "aspire-dashboard"
            }
        }
    }

  # azurerm_container_group.monitoring[0] will be created
  + resource "azurerm_container_group" "monitoring" {
      + dns_name_label              = "onlinestore-prod-monitoring"
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = (known after apply)
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Public"
      + location                    = "eastus"
      + name                        = "onlinestore-containergroup-monitoring"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "onlinestore-prod-rg"
      + restart_policy              = "Always"
      + sku                         = "Standard"
      + tags                        = {
          + "environment" = "prod"
        }

      + container {
          + commands              = (known after apply)
          + cpu                   = 0.05
          + environment_variables = {
              + "DOTNET_DASHBOARD_UNSECURED_ALLOW_ANONYMOUS" = "true"
            }
          + image                 = "onlinestorecontainerregistry.azurecr.io/dotnet/aspire-dashboard:8.0.0"
          + memory                = 0.2
          + name                  = "aspire-dashboard"

          + ports {
              + port     = 18888
              + protocol = "TCP"
            }
          + ports {
              + port     = 18889
              + protocol = "TCP"
            }
        }

      + image_registry_credential {
          + password = (sensitive value)
          + server   = "onlinestorecontainerregistry.azurecr.io"
          + username = (sensitive value)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + container_instance_monitoring_fqdn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @benchiverton, Action: `pull_request`, Working Directory: ``, Workflow: `Instance - plan prod`*